{"pageProps":{"post":{"title":"Cómo escribir comentarios en Go (Golang)","date":"2022-01-04T05:35:07.322Z","slug":"go/comentarios-en-golang","author":{"name":"Fabián Karaben","picture":"/assets/authors/fabian.png"},"content":"<p>Los comentarios son líneas que existen en el código de los programas, y que son ignoradas por compiladores e intérpretes.</p>\n<p>La inclusión de comentarios en los programas hace que el código sea más legible para los humanos, puesto que proporciona cierta información o explicación sobre lo que hace cada parte de un programa.</p>\n<p>Dependiendo del propósito del programa, los comentarios pueden servir como notas para uno mismo, como recordatorios, o pueden escribirse con la intención de que otros programadores puedan entender lo que está haciendo el código.</p>\n<p>En general, es una buena idea escribir comentarios mientras escribes o actualizas un programa, ya que es fácil olvidar el hilo de pensamiento que tenías al escribirlo, y los comentarios pueden ser útiles a largo plazo.</p>\n<h2>Sintaxis de comentarios</h2>\n<p>Los comentarios en Go comienzan con un conjunto de barras diagonales (<code>//</code>) y continúan hasta el final de la línea. Es idiomático tener un espacio en blanco después del conjunto de barras diagonales.</p>\n<p>Generalmente, los comentarios se verán así:</p>\n<pre><code class=\"language-go\">// Esto es un comentario\n</code></pre>\n<p>Los comentarios no se ejecutan, por lo que no habrá ninguna acción a partir de un comentario al ejecutar un programa. Los comentarios están en el código fuente para que los lean los humanos, no para que los ejecuten las computadoras.</p>\n<p>En un programa \"¡Hola, mundo!\", un comentario puede verse así:</p>\n<pre><code class=\"language-go\">package main\n\nimport (\n\t\"fmt\"\n)\n\nfunc main() {\n\t// Print “Hello, World!” to console\n\tfmt.Println(\"Hello, World!\")\n}\n</code></pre>\n<p>En un bucle <code>for</code> que itera sobre un segmento, los comentarios pueden verse así:</p>\n<pre><code class=\"language-go\">package main\n\nimport (\n\t\"fmt\"\n)\n\nfunc main() {\n\t// Define sharks variable as a slice of strings\n\tsharks := []string{\"hammerhead\", \"great white\", \"dogfish\", \"frilled\", \"bullhead\", \"requiem\"}\n\n\t// For loop that iterates over sharks list and prints each string item\n\tfor _, shark := range sharks {\n\t\tfmt.Println(shark)\n\t}\n}\n</code></pre>\n<p>Los comentarios deben hacerse con la misma sangría que el código que se está comentando. Es decir, una definición de función sin sangría tendría un comentario sin sangría, y cada nivel de sangría siguiente tendría comentarios que están alineados con el código que se está comentando.</p>\n<p>Por ejemplo, así es como se comenta la función <code>main</code>, con comentarios después de cada nivel de sangría del código:</p>\n<pre><code class=\"language-go\">package main\n\nimport \"fmt\"\n\nconst favColor string = \"blue\"\n\nfunc main() {\n\tvar guess string\n\t// Create an input loop\n\tfor {\n\t\t// Ask the user to guess my favorite color\n\t\tfmt.Println(\"Guess my favorite color:\")\n\t\t// Try to read a line of input from the user. Print out the error 0\n\t\tif _, err := fmt.Scanln(&#x26;guess); err != nil {\n\t\t\tfmt.Printf(\"%s\\n\", err)\n\t\t\treturn\n\t\t}\n\t\t// Did they guess the correct color?\n\t\tif favColor == guess {\n\t\t\t// They guessed it!\n\t\t\tfmt.Printf(\"%q is my favorite color!\\n\", favColor)\n\t\t\treturn\n\t\t}\n\t\t// Wrong! Have them guess again.\n\t\tfmt.Printf(\"Sorry, %q is not my favorite color. Guess again.\\n\", guess)\n\t}\n}\n</code></pre>\n<p>Los comentarios se hacen para ayudar a los programadores, ya sea el programador original o alguien más que esté usando o colaborando en el proyecto. Si los comentarios no se pueden mantener y actualizar correctamente junto con el código base, es mejor no incluir un comentario en lugar de escribir un comentario que  contradiga el código.</p>\n<p>Al comentar el código, debes buscar responder el por qué detrás del código en lugar del qué o cómo. A menos que el código sea particularmente complicado, mirar el código generalmente puede responder el qué o el cómo, razón por la cual los comentarios generalmente se centran en el por qué.</p>\n<h2>Comentarios en bloque</h2>\n<p>Los comentarios en bloque se pueden utilizar para explicar código más complicado o código con el que no esperas que el lector esté familiarizado.</p>\n<p>Puedes crear comentarios en bloque de dos formas en Go. La primera es utilizar un conjunto de barras diagonales dobles y repetirlas para cada línea.</p>\n<pre><code class=\"language-go\">// Primera línea de un comentario de bloque\n// Segunda línea de un comentario de bloque\n</code></pre>\n<p>La segunda es usar etiquetas de apertura (<code>/*</code>) y etiquetas de cierre (<code>*/</code>). Para documentar código, se considera idiomático utilizar siempre la sintaxis <code>//</code>. Solo emplearías la sintaxis <code>/* ... */</code> para depurar, que cubriremos más adelante en este artículo.</p>\n<pre><code class=\"language-go\">/ *\nTodo aqui\nserá considerado\nun comentario de bloque\n* /\n</code></pre>\n<p>En este ejemplo, el comentario del bloque define lo que está sucediendo en la función <code>MustGet()</code>:</p>\n<pre><code class=\"language-go\">// MustGet will retrieve a url and return the body of the page.\n// If Get encounters any errors, it will panic.\nfunc MustGet(url string) string {\n\tresp, err := http.Get(url)\n\tif err != nil {\n\t\tpanic(err)\n\t}\n\n\t// don't forget to close the body\n\tdefer resp.Body.Close()\n\tvar body []byte\n\tif body, err = ioutil.ReadAll(resp.Body); err != nil {\n\t\tpanic(err)\n\t}\n\treturn string(body)\n}\n</code></pre>\n<p>Es común ver comentarios de bloque al comienzo de las funciones exportadas en Go. Estos comentarios son también los que generan la documentación de tu código.</p>\n<p>Los comentarios de bloque también se utilizan cuando las operaciones son menos sencillas y, por lo tanto, exigen una explicación detallada. Con la excepción de las funciones de documentación, debes tratar de evitar comentar demasiado el código y confiar en que otros programadores comprenderán, a menos que estés escribiendo para una audiencia en particular.</p>\n<h2>Comentarios en línea</h2>\n<p>Los comentarios en línea ocurren en la misma línea de una declaración, justo después del código mismo. Como otros comentarios, comienzan con una serie de barras diagonales.</p>\n<p>Nuevamente, no es necesario tener un espacio en blanco después de las barras diagonales, pero se considera idiomático hacerlo.</p>\n<p>Generalmente, los comentarios en línea tienen este aspecto:</p>\n<pre><code class=\"language-go\">// Comentario en línea sobre el código\n</code></pre>\n<p>Los comentarios en línea deben usarse con moderación, sin embargo, pueden ser efectivos para explicar partes complicadas o no obvias del código. También pueden ser útiles si crees que es posible que en el futuro no recuerdes una línea del código que estás escribiendo, o si estás colaborando con alguien que sabes que puede no estar familiarizado con todos los aspectos del código.</p>\n<p>Por ejemplo, si no usas muchas matemáticas en tus programas Go, es posible que tú o tus colaboradores no sepan que lo siguiente crea un número complejo, por lo que puedes incluir un comentario en línea sobre eso:</p>\n<pre><code class=\"language-go\">z := x % 2 // Obtiene el módulo de x\n</code></pre>\n<p>También puedes utilizar comentarios en línea para explicar la razón detrás de hacer algo, o para proporcionar información adicional, como en:</p>\n<pre><code class=\"language-go\">x := 8 // Inicializar x con un número arbitrario\n</code></pre>\n<p>Solo debes utilizar comentarios en línea cuando sea necesario y cuando puedan proporcionar una guía útil para la persona que lee el programa.</p>\n<h2>Comentar el código para realizar pruebas</h2>\n<p>Además de utilizar comentarios como una forma de documentar el código, también puedes emplear etiquetas de apertura (<code>/*</code>) y etiquetas de cierre (<code>*/</code>) para crear un comentario de bloque. Esto te permite comentar el código que no deseas ejecutar mientras estás probando o depurando un programa. Es decir, cuando experimentes errores después de implementar nuevas líneas de código, es posible que desees comentar algunas de ellas para ver si puedes solucionar el problema.</p>\n<p>El uso de las etiquetas <code>/*</code> y <code>*/</code> también puede permitirte probar alternativas mientras determinas cómo configurar tu código. También puedes usar comentarios de bloque para comentar el código que falla mientras continúas trabajando en otras partes de tu código.</p>\n<pre><code class=\"language-go\">// Function to add two numbers\nfunc addTwoNumbers(x, y int) int {\n\tsum := x + y\n\treturn sum\n}\n\n// Function to multiply two numbers\nfunc multiplyTwoNumbers(x, y int) int {\n\tproduct := x * y\n\treturn product\n}\n\nfunc main() {\n\t/*\n\t   In this example, we're commenting out the addTwoNumbers\n\t   function because it is failing, therefore preventing it from executing.\n\t   Only the multiplyTwoNumbers function will run\n\n\t   a := addTwoNumbers(3, 5)\n\t   fmt.Println(a)\n\n\t*/\n\n\tm := multiplyTwoNumbers(5, 9)\n\tfmt.Println(m)\n}\n</code></pre>\n<blockquote>\n<p><strong>Nota</strong>: Comentar el código solamente debe hacerse con fines de prueba. No dejes fragmentos de código comentado en tu programa final.</p>\n</blockquote>\n<p>Comentar el código con las etiquetas <code>/*</code> y <code>*/</code> puede permitirte probar diferentes métodos de programación, así como ayudarte a encontrar la fuente de un error al comentar sistemáticamente y ejecutar partes de un programa.</p>\n<h2>Conclusión</h2>\n<p>El empleo de comentarios dentro de tu código Go ayudarán a que tus programas sean más legibles para los humanos, incluido tú mismo en el futuro. Agregar comentarios apropiados que sean relevantes y útiles puede facilitar que otros colaboren en tus proyectos.</p>\n<p>Comentar tu código correctamente en Go también te permitirá utilizar la herramienta <em>Godoc</em>, la cual es una herramienta que extraerá comentarios de tu código y generará documentación automáticamente para tu programa Go.</p>\n","ogImage":{"url":"/assets/go/comentarios-go.png"},"coverImage":"/assets/go/comentarios-go.png"}},"__N_SSG":true}