{"pageProps":{"post":{"title":"Mis apuntes git, conceptos y comandos","date":"2021-12-18T05:35:07.322Z","slug":"apuntes/git","author":{"name":"Fabián Karaben","picture":"/assets/authors/fabian.png"},"content":"<h2>Introducción</h2>\n<p>Aprender Git es fundamental en el desarrollo de software, no importa qué tecnología utilices, o si trabajas de forma individual o en grupo.</p>\n<p>Usualmente Git trabaja de una manera formidable si es orientado al código, porque Git va a poder analizar los archivos, determinar qué cambió, hacer uniones de código, y todo de manera automática.</p>\n<p>Ahora, va a llegar un punto donde Git no lo va a poder hacer de manera automática, como cuando dos personas tocan el mismo código, se produce un conflicto y en esos casos Git necesita que ese conflicto se resuelva manualmente.</p>\n<p>Enfrentarse a conflictos es algo normal, no hay que asustarse, e incluso existen técnicas para evitar tener una gran cantidad de conflictos.</p>\n<p>Solo veremos la utilización de Git a través de comando de consola, para poder abarcar todos los conceptos necesarios, luego con esa información aprendida es sencillo que cada quien elija el gestor gráfico de repositorios Git que más le guste.</p>\n<h2>Conceptos</h2>\n<h3>Repositorio</h3>\n<p>Es el nombre que Git da a cada proyecto de código, aunque un repositorio puede almacenar cualquier tipo de contenido, no solamente código de programación.</p>\n<h3>Stage</h3>\n<p>Inicialmente un repositorio tiene todos sus archivos sin seguimiento. Posteriormente podemos agregar uno, varios o todos los archivos al \"Stage\" lo cual podríamos entenderlo con la analogía de un escenario donde se va a sacar una foto. Subimos archivos al escenario (agregándolo al stage) para luego tomar la fotografía (realizar un commit).</p>\n<h3>Commit</h3>\n<p>Siguiendo la analogía del concepto de 'Stage', realizar un commit es como tomar una fotografía de todos los archivos que se encuentran en el 'stage', esto es, guardar el estado actual de todos esos archivos y dejarlo registrado en la línea del tiempo de nuestro repositorio Git.</p>\n<h2>Comandos</h2>\n<h4>Conocer la versión instalada de Git</h4>\n<pre><code>git --version\n</code></pre>\n<h4>Visualizar el contenido de ayuda del comando de Git</h4>\n<p>Ver la ayuda general:</p>\n<pre><code>git help\n</code></pre>\n<p>Ver la ayuda de un subcomando específico:</p>\n<pre><code>git help commit\n</code></pre>\n<h4>Configuración inicial de Git</h4>\n<p>Configurar el nombre del usuario:</p>\n<pre><code>git config --global user.name = \"Fabian Karaben\"\n</code></pre>\n<p>Configurar el email del usuario:</p>\n<pre><code>git config --global user.email = \"fabian@example.com\"\n</code></pre>\n<p>Ver y opcionalmente editar la configuración actual del usuario:</p>\n<pre><code>git config --global -e\n</code></pre>\n<h4>Inicializar un repositorio</h4>\n<pre><code>git init\n</code></pre>\n<h4>Ver el estado del repositorio</h4>\n<p>Este comando muestra información sobre los commits, sobre la rama actual, y más:</p>\n<pre><code>git status\n</code></pre>\n<h4>Agregar y remover archivos del 'stage'</h4>\n<p>Agregar un archivo específico al stage:</p>\n<pre><code>git add index.html\n</code></pre>\n<p>Agregar todos los archivos al stage:</p>\n<pre><code>git add .\n</code></pre>\n<p>Remover un archivo específico del stage:</p>\n<pre><code>git reset index.html\n</code></pre>\n<h4>Commits</h4>\n<p>Realizar un commit</p>\n<pre><code>git commit -m \"Un mensaje descriptivo para este commit\"\n</code></pre>\n<blockquote>\n<p>Nota: este artículo será actualizado con más contenido.</p>\n</blockquote>\n","ogImage":{"url":"/assets/apuntes/git.png"},"coverImage":"/assets/apuntes/git.png"}},"__N_SSG":true}