{"pageProps":{"post":{"title":"Cómo crear tu primer programa en Go (Golang)","date":"2022-01-02T05:35:07.322Z","slug":"go/tu-primer-programa","author":{"name":"Fabián Karaben","picture":"/assets/authors/fabian.png"},"content":"<p>El clásico programa \"¡Hola Mundo!\" es una tradición en programación. Es un simple pero completo programa para principiantes, y también es una buena manera de estar seguros de que el entorno de desarrollo está correctamente configurado.</p>\n<p>Este artículo te llevará a través de la creación de ese primer programa en Go. Sin embargo, para hacer el programa más interesante, modificaremos el tradicional \"¡Hola Mundo!\" de tal manera que pregunte tu nombre y luego imprima un saludo.</p>\n<p>Cuando finalices este artículo, tendrás un programa que lucirá así al ejecutarse:</p>\n<pre><code class=\"language-bash\">go run hello.go\nPor favor ingresa tu nombre:\nSammy\n¡Hola Sammy!, yo soy Go.\n</code></pre>\n<h2>Prerrequisitos</h2>\n<p>Antes de iniciar este tutorial, necesitarás tener configurado tu entorno local de desarrollo en Go. Puedes consultar las siguientes guías si necesitas ayuda con esto:</p>\n<ul>\n<li><a href=\"https://www.digitalocean.com/community/tutorials/how-to-install-go-and-set-up-a-local-programming-environment-on-macos\">Cómo instalar Go en macOS</a></li>\n<li><a href=\"https://www.digitalocean.com/community/tutorials/how-to-install-go-and-set-up-a-local-programming-environment-on-ubuntu-18-04\">Cómo instalar Go en Ubuntu</a></li>\n<li><a href=\"https://www.digitalocean.com/community/tutorials/how-to-install-go-and-set-up-a-local-programming-environment-on-windows-10\">Cómo instalar Go en Windows</a></li>\n</ul>\n<h2>Paso 1: Escribir el programa \"¡Hola Mundo!\" básico</h2>\n<p>Para escribir el programa \"¡Hola Mundo!\", abre un editor de línea de comandos, como por ejemplo <code>nano</code>, creando un nuevo archivo <code>hello.go</code>, así:</p>\n<pre><code class=\"language-bash\">nano hello.go\n</code></pre>\n<p>Esto también se puede hacer en editores de interfaz gráfica, como el popular Visual Studio Code.</p>\n<p>Ya con el editor abierto, escribe el siguiente código:</p>\n<pre><code class=\"language-go\">package main\n\nimport \"fmt\"\n\nfunc main() {\n\tfmt.Println(\"¡Hola Mundo!\")\n}\n</code></pre>\n<p>Analicemos cada parte de este código.</p>\n<p>La palabra clave <code>package</code> define a qué paquete de código pertenece este archivo. Puede haber solo un paquete por carpeta y cada archivo <code>.go</code> debe declarar el mismo paquete en la parte superior de su contenido. En este ejemplo el código pertenece al paquete <code>main</code>.</p>\n<p>La palabra clave <code>import</code> le dice al compilador de Go qué otros paquetes vas a usar en este archivo. Aquí estamos importando el paquete <code>fmt</code> que pertenece a la biblioteca estándar de Go. El paquete <code>fmt</code> provee funcionalidades para dar formato e imprimir contenido, lo cual es muy útil durante el desarrollo.</p>\n<p>La función <code>Println</code>, perteneciente al paquete <code>fmt</code>, dice a la computadora que imprima el texto especificado en pantalla. El texto es <code>\"¡Hola Mundo\"</code>, el cual se encuentra entre comillas porque se trata de un <code>string</code>, el tipo de dato que representa los textos. La función <code>fmt.Println</code> imprimirá este <code>string</code> en la pantalla donde el programa se ejecute.</p>\n<p>Para finalizar este paso, guarda el contenido y cierra el editor <em>nano</em> presionando las teclas <code>CTRL + X</code>, y luego la tecla <code>Y</code> para aceptar que los cambios se guarden.</p>\n<p>En el siguiente paso probaremos este programa.</p>\n<h2>Paso 2: Ejecutar el programa de Go</h2>\n<p>Con el programa \"¡Hola Mundo!\" escrito, ahora estás listo para ejecutarlo. Para esto, utilizarás el comando <code>go run</code> seguido del nombre del archivo que acabas de crear, de esta forma:</p>\n<pre><code class=\"language-bash\">go run hello.go\n</code></pre>\n<p>La salida que verás en la misma consola debe ser:</p>\n<pre><code class=\"language-bash\">¡Hola Mundo!\n</code></pre>\n<p>Analicemos qué es lo que ha pasado.</p>\n<p>El programa necesita ser compilado antes de ejecutarse. Cuando ejecutas el comando <code>go run</code> seguido del nombre del archivo, en este caso <code>hello.go</code>, el comando <code>go</code> compila el código y luego ejecuta el binario resultante.</p>\n<p>Para los programas escritos en lenguajes de programación compilados, el compilador toma el código del programa y genera otro tipo de código de bajo nivel (el código de máquina) que es el ejecutable final del programa.</p>\n<p>Los programas de Go requieren un paquete <code>main</code> y exactamente una función <code>main()</code> que funciona como punto de entrada para la aplicación. La función <code>main</code> no recibe argumentos ni devuelve valores, pero le dice al compilador de Go que este paquete debe ser compilado como un ejecutable, ya que existen otros casos en los que un paquete está destinado a ser utilizado por otros paquetes y no a generar un archivo ejecutable.</p>\n<p>Una vez compilado, el binario internamente ejecuta la instrucción correspondiente a la línea <code>fmt.Println(\"¡Hola Mundo!\")</code>, lo cual envía este texto a ser impreso en pantalla.</p>\n<p>Las comillas alrededor del texto <code>¡Hola Mundo!</code> no se imprimen, ya que estas son parte de la definición del <code>string</code>.</p>\n<p>En este paso has compilado y ejecutado un programa \"¡Hola Mundo!\" completo.</p>\n<h2>Paso 3: Solicitar entradas del usuario</h2>\n<p>Hasta ahora, cada vez que ejecutas tu programa, produces el mismo resultado. En este paso, agregarás a tu programa la funcionalidad de solicitar al usuario su nombre, para luego utilizar su nombre en la salida.</p>\n<p>En lugar de modificar tu programa existente, crea un nuevo programa llamado <code>greeting.go</code> con el editor <em>nano</em>:</p>\n<pre><code class=\"language-bash\">nano greeting.go\n</code></pre>\n<p>Primero, agrega este código, que solicita al usuario que ingrese su nombre:</p>\n<pre><code class=\"language-go\">package main\n\nimport (\n\t\"fmt\"\n)\n\nfunc main() {\n\tfmt.Println(\"Por favor, escribe tu nombre.\")\n}\n</code></pre>\n<p>Una vez más, usa la función <code>fmt.Println</code> para imprimir texto en la pantalla.</p>\n<p>Ahora agrega la línea <code>var name string</code> para almacenar la entrada del usuario:</p>\n<pre><code class=\"language-go\">package main\n\nimport (\n\t\"fmt\"\n)\n\nfunc main() {\n\tfmt.Println(\"Por favor, escribe tu nombre.\")\n\tvar name string\n}\n</code></pre>\n<p>La línea <code>var name string</code> creará una nueva variable utilizando la palabra clave <code>var</code>. Tú decides el nombre de la variable, pero deberá ser de tipo <code>string</code>. Luego, agrega la línea <code>fmt.Scanln(&#x26;name)</code> para capturar la entrada del usuario:</p>\n<pre><code class=\"language-go\">package main\n\nimport (\n\t\"fmt\"\n)\n\nfunc main() {\n\tfmt.Println(\"Por favor, escribe tu nombre.\")\n\tvar name string\n\tfmt.Scanln(&#x26;name)\n}\n</code></pre>\n<p>El método <code>fmt.Scanln</code> le dice a la computadora que espere la entrada del teclado que termine con una nueva línea o el carácter <code>\\n</code>. Esto detiene el programa, lo que permite al usuario ingresar cualquier texto que desee. El programa continuará cuando el usuario presione la tecla <em>ENTER</em> en su teclado. Todas las pulsaciones de teclas, incluida la pulsación de tecla <em>ENTER</em>, se capturan y convierten en una cadena de caracteres.</p>\n<p>Ahora necesitamos utilizar esos caracteres en la salida del programa, por lo que guardaremos esos caracteres escribiéndolos en la variable <code>string</code> llamada <code>name</code>. <em>Go</em> almacena esa cadena en la memoria de tu computadora hasta que el programa termine de ejecutarse.</p>\n<p>Finalmente, agrega la línea <code>fmt.Printf(\"Hola, %s! Yoo soy Go!\", name)</code> a tu programa para imprimir la salida:</p>\n<pre><code class=\"language-go\">package main\n\nimport (\n\t\"fmt\"\n)\n\nfunc main() {\n\tfmt.Println(\"Por favor, escribe tu nombre.\")\n\tvar name string\n\tfmt.Scanln(&#x26;name)\n\tfmt.Printf(\"Hola, %s! Yoo soy Go!\", name)\n}\n</code></pre>\n<p>Esta vez, en lugar de usar el método <code>fmt.Println</code> nuevamente, estás usando <code>fmt.Printf</code>. La función <code>fmt.Printf</code> toma una cadena y, utilizando verbos de impresión especiales, (<code>%s</code>), inyecta el valor de <code>name</code> en la cadena. Hace esto porque <em>Go</em> no admite la interpolación de cadenas, lo que te permitiría tomar el valor asignado a una variable y colocarlo dentro de una cadena.</p>\n<p>Guarda los cambios y sal de <em>nano</em> presionando <em>CTRL+X</em>, y luego <em>Y</em> cuando se te solicite guardar el archivo.</p>\n<p>Ahora ejecuta el programa. Se te pedirá tu nombre, así que ingrésalo y presiona <em>ENTER</em>.</p>\n<p>Es posible que el resultado no sea exactamente el esperado:</p>\n<pre><code class=\"language-bash\">Por favor, escribe tu nombre.\nSammy\nHola Sammy\n! Yo soy Go!\n</code></pre>\n<p>En lugar de <code>Hola, Sammy! Yo soy Go !</code>, hay un salto de línea justo después del nombre. El programa capturó todas nuestras pulsaciones de teclas, incluida la tecla <em>ENTER</em> que presionamos para decirle al programa que continúe. En una cadena, presionar la tecla <em>ENTER</em> crea un carácter especial que crea una nueva línea. La salida del programa está haciendo exactamente lo que se le dijo que hiciera; muestra el texto que ingresaste, incluida esa nueva línea.</p>\n<p>No es lo que esperábamos que fuera el resultado, pero esto puede solucionarse con funciones adicionales.</p>\n<p>Abre el archivo <code>greeting.go</code> en tu editor y localiza esta línea en tu programa:</p>\n<pre><code class=\"language-go\">fmt.Scanln(&#x26;name)\n</code></pre>\n<p>Agrega la siguiente línea inmediatamente después:</p>\n<pre><code class=\"language-go\">name = strings.TrimSpace(name)\n</code></pre>\n<p>Esto usa la función <code>TrimSpace</code>, del paquete <code>strings</code> de la biblioteca estándar de Go, en la cadena que capturaste con <code>fmt.Scanln</code>. La función <code>strings.TrimSpace</code> elimina cualquier carácter de espacio, incluidas las nuevas líneas, del principio y el final de una cadena. En este caso, elimina el carácter de nueva línea al final de la cadena creada cuando presionaste <em>ENTER</em>.</p>\n<p>Para utilizar la biblioteca <code>strings</code>, debes importarlo en la parte superior del programa. Busca estas líneas en tu programa:</p>\n<pre><code class=\"language-go\">import (\n\t\"fmt\"\n)\n</code></pre>\n<p>Agrega la siguiente línea para importar el paquete <code>strings</code>:</p>\n<pre><code class=\"language-go\">import (\n\t\"fmt\"\n\t\"strings\"\n)\n</code></pre>\n<p>Tu programa ahora contendrá lo siguiente:</p>\n<pre><code class=\"language-go\">package main\n\nimport (\n\t\"fmt\"\n\t\"strings\"\n)\n\nfunc main() {\n\tfmt.Println(\"Por favor, escribe tu nombre.\")\n\tvar name string\n\tfmt.Scanln(&#x26;name)\n\tname = strings.TrimSpace(name)\n\tfmt.Printf(\"Hola, %s! Yo soy Go!\", name)\n}\n</code></pre>\n<p>Guarda y sal de <em>nano</em>. Presione <em>CTRL+X</em>, luego presione <em>Y</em>.</p>\n<p>Ejecuta el programa nuevamente:</p>\n<pre><code class=\"language-bash\">go run greeting.go\n</code></pre>\n<p>Esta vez, después de ingresar tu nombre y presionar <em>ENTER</em>, obtendrás el resultado esperado:</p>\n<pre><code class=\"language-bash\">Por favor, escribe tu nombre.\nSammy\nHola, Sammy! Yo soy Go!\n</code></pre>\n<p>Ahora tienes un programa Go que toma la entrada de un usuario y la vuelve a imprimir en la pantalla.</p>\n<h2>Código del artículo</h2>\n<p>Puedes encontrar el código fuente de este artículo en el siguiente repositorio de GitHub:</p>\n<p><a href=\"https://github.com/fabiankaraben/how-to-code-in-go\">How to code in Go (Code)</a></p>\n<p>en el directorio <code>7-first-program</code>.</p>\n<h2>Conclusión</h2>\n<p>En este tutorial, escribiste un programa \"¡Hola, mundo!\" y luego lo mejoraste para que tome la entrada de un usuario, procese los resultados y muestre una salida en pantalla.</p>\n<p>Ahora que tiene un programa básico con el que trabajar, intente expandirlo aún más. Por ejemplo, pregunta por el color favorito del usuario y haz que el programa diga que su color favorito es el rojo. Incluso podría intentar utilizar esta misma técnica para crear un programa <em>Mad-Lib</em> simple.</p>\n","ogImage":{"url":"/assets/go/primer-programa-go.png"},"coverImage":"/assets/go/primer-programa-go.png"}},"__N_SSG":true}