{"pageProps":{"post":{"title":"¿Qué son las Cookies HTTP?","date":"2021-12-11T05:35:07.322Z","slug":"que-es/cookies-http","author":{"name":"Fabián Karaben","picture":"/assets/authors/fabian.png"},"content":"<p>De una forma u otra, todos los días utilizamos internet e interactuamos con cookies HTTP. Las cookies HTTP permiten a las páginas web personalizar la experiencia de usuario que nos entregan. Es una funcionalidad muy útil que algunas veces simplemente se ignora o incluso se malinterpreta.</p>\n<p>Desde el otro lado de un sitio o aplicación web, las cookies HTTP permiten a los desarrolladores crear funcionalidades y comportamientos que se ajusten a las preferencias detectadas del usuario.</p>\n<p>Más allá de todos estos beneficios es necesario tener en cuenta algunos riesgos de seguridad relacionados con las cookies HTTP, tópico bastante escuchado en los últimos años, sobre todo entre personas que se preocupan por cada detalle en la utilización de la información personal.</p>\n<p>En este artículo explicaré cómo funcionan las cookies HTTP.</p>\n<h2>¿Qué son las cookies HTTP?</h2>\n<p>Las cookies son pequeñas piezas de datos almacenados en el navegador web y que se envían al servidor en cada solicitud. Son utilizadas para almacenar el estado de la sesión de usuario, preferencias y también seguimiento del usuario.</p>\n<h3>Gestión de la sesión del usuario</h3>\n<p>La gestión de la sesión del usuario permite la interacción segura entre el usuario y algún servicio o aplicación. A medida que el usuario continúa interactuando con la aplicación web, se envían datos que especifican si la sesión del usuario continúa activa.</p>\n<p>Algunos ejemplos: Logins (sesión iniciada con una cuenta de usuario), autocompletado de formularios, carros de compra.</p>\n<h3>Personalizaciones del usuario</h3>\n<p>Almacena preferencias del usuario especificadas en la configuración, para ser  usadas las próximas veces que el usuario ingrese a la aplicación.</p>\n<p>Algunos ejemplos: Preferencias, temas de interfaz (claro u oscuro), idioma.</p>\n<h3>Seguimiento</h3>\n<p>Registra y analiza hábitos y búsquedas del usuario en el navegador web. Los detalles incluyen el tiempo que el usuario permanece en una página determinada dentro de la aplicación o sitio web, y la lista de las páginas visitadas. Debido a la información confidencial detrás del seguimiento, los usuarios deben estar al tanto de las vulnerabilidades al visitar páginas web inseguras.</p>\n<p>Ejemplo: seguimiento de anuncios</p>\n<h2>¿Cómo crear cookies HTTP?</h2>\n<h3>En el lado del cliente</h3>\n<p>Desde la consola de tu navegador web, puedes configurar una cookie con JavaScript escribiendo el siguiente código:</p>\n<pre><code class=\"language-javascript\">document.cookie=\"example=1\"\n</code></pre>\n<p>Para comprobar si tu cookie está configurada, abre la pestaña \"Aplicación\" y haz clic en la pestaña \"Cookies\" para acceder a tu nueva cookie. Deberías ver algo como lo siguiente:</p>\n<p><img src=\"/assets/que-es/Cookies-HTTP-dev-application-tab.png\" alt=\"cookie.png\"></p>\n<h2>Propiedades de las cookies</h2>\n<h3>Cookie scope</h3>\n<p>El alcance de una cookie determina a qué URL se deben enviar las cookies.</p>\n<h3><code>Expires</code> y <code>Max-age</code></h3>\n<p>Otra propiedad a considerar es la vida útil de una cookie o, más simplemente, la fecha de vencimiento de la cookie.</p>\n<p>El atributo <code>Expires</code> eliminará una cookie en una fecha específica. Por el contrario, el atributo <code>Max-age</code> eliminará una cookie después de un período de tiempo específico.</p>\n<h3><code>SameSite</code></h3>\n<p>Cubrimos anteriormente cómo se configuran las cookies HTTP para URL directas, pero ¿qué pasa al hacer clic en un enlace dentro de esa URL directa?</p>\n<p>Al hacer clic en un enlace dentro de una página, sus cookies se pueden enviar desde la nueva página a la que se le dirige. Aquí es donde entra en juego el atributo <code>SameSite</code>. En pocas palabras, <code>Samesite</code> especifica si las cookies se envían con solicitudes entre sitios o cada vez que hace clic en un enlace en una página determinada.</p>\n<h2>Tipos de cookies HTTP</h2>\n<h3>Session cookies</h3>\n<p>También conocidas como cookies temporales, las cookies de sesión caducan una vez que cierra o abandona el navegador. Notarás que un sitio web está utilizando cookies de sesión cuando tengas que ingresar tus credenciales de inicio de sesión cada vez que abras la página.</p>\n<h3>First-Party cookies</h3>\n<p>Las cookies de origen son almacenadas directamente en tu computadora por el sitio web que estás visitando. El sitio web recopila y análisis información útil para mejorar tu experiencia de usuario.</p>\n<h3>Third-Party cookies</h3>\n<p>Las cookies de terceros son creadas por dominios distintos al que accede directamente. Generalmente, se usan con fines de seguimiento, las cookies de terceros se almacenan incluso después de que se cierra el navegador.</p>\n<p>Un caso de uso común implica el seguimiento de anuncios de sitios web distintos a los que visitas.</p>\n<h3>Secure cookies</h3>\n<p>Las cookies seguras evitan que las partes no autorizadas observen las cookies enviadas a un nuevo usuario dentro de una respuesta HTTP. Con el atributo <code>Secure</code>, las solicitudes HTTP solo incluirán la cookie si se transmiten a través de un canal seguro.</p>\n<h3>Zombie cookies</h3>\n<p>Las cookies zombis son cookies que vuelven a la vida incluso cuando se eliminan o se cierra el navegador. Las cookies de Zombie se almacenan en lugares fuera del almacenamiento de cookies dedicado del navegador web. Cuando el usuario destruye una cookie, una cookie zombi puede tomar la réplica almacenada en otro lugar y adjuntarla al almacenamiento de cookies del usuario nuevamente.</p>\n<h2>Conclusión</h2>\n<p>Hemos visto las principales características de las cookies HTML y aunque muchas veces se las presenta como algo muy peligroso a evitar siempre, normalmente son muy útiles y beneficiosas.</p>\n<p>Simplemente hay que evitar proveer datos sensibles a sitios web que no sean de confianza, incluso la mayoría de los sitios web nos muestran un mensaje dándonos la posibilidad de habilitar o no el uso de cookies.</p>\n","ogImage":{"url":"/assets/que-es/Cookies-HTTP.png"},"coverImage":"/assets/que-es/Cookies-HTTP.png"}},"__N_SSG":true}